Ebiroll/qemu-stm32/hw/arm/stm32/stm32l552_rtc.c
// Compute the period for the wakeup timer in nanoseconds if the WUT counter is set to the
// given value
static uint64_t
l552_wut_period_ns(STM32L552RtcState *s, uint32_t counter)
{
    uint32_t clock_sel = s->regs[R_RTC_CR] & 0x07;

    // NOTE: We are making the assumption here, as in l552_clock_period_ns, that RTC_CLK
    // is the 32768 LSE clock
    uint64_t rtc_clk_period_ns = 1000000000LL / 32768;

    // Using the synchronous clock (clk_spre)
    if (clock_sel & 0x04) {
        if (clock_sel & 0x02) {
            return counter * l552_clock_period_ns(s);
        } else {
            return (counter + 65536) * l552_clock_period_ns(s);
        }
    } else if (clock_sel == 0) {
        return counter * rtc_clk_period_ns * 16;
    } else if (clock_sel == 1) {
        return counter * rtc_clk_period_ns * 8;
    } else if (clock_sel == 2) {
        return counter * rtc_clk_period_ns * 4;
    } else if (clock_sel == 3) {
        return counter * rtc_clk_period_ns * 2;
    } else {
        abort();
    }
}


// Set the time and registers based on the content of the passed in tm struct
static void
l552_rtc_set_time_and_date_registers(STM32L552RtcState *s, struct tm *tm)
{
    uint8_t wday;

    wday = tm->tm_wday == 0 ? tm->tm_wday : 7;
    s->regs[R_RTC_TR] = to_bcd(tm->tm_sec) |
                        to_bcd(tm->tm_min) << 8 |
                        to_bcd(tm->tm_hour) << 16;
    s->regs[R_RTC_DR] = to_bcd(tm->tm_mday) |
                        to_bcd(tm->tm_mon + 1) << 8 |
                        wday << 13 |
                        to_bcd(tm->tm_year % 100) << 16;
}


// Compute what time we want in the target based on the host's current date and time.
// This takes into consideration the host_to_target_offset_us we have computed and captured
// previously.
// The rtc_period_ns passed in is the number of nanoseconds in host time that corresponds to 1
// "tick" (i.e. a second increment in the RTC register). Usually, you would expect this to
// be 1e9, but on Pebble plastic for example, the firmware sets up the RTC so that the
// seconds increment 1024 times/sec.
static time_t
l552_rtc_compute_target_time_from_host_time(STM32L552RtcState *s, uint64_t rtc_period_ns,
                                            struct tm *target_tm)
{
    // Get the host time in microseconds
    struct timeval tv;
    gettimeofday(&tv, NULL);
    int64_t host_time_us = tv.tv_sec * 1000000LL + (tv.tv_usec);

    // Compute the target time by adding the offset
    int64_t target_time_us = host_time_us + s->host_to_target_offset_us;

    // Convert to target ticks according period set in the RTC
    time_t target_time_ticks = (target_time_us * 1000) / rtc_period_ns;
    
    // Convert to date, hour, min, sec components
    gmtime_r(&target_time_ticks, target_tm);


#ifdef DEBUG_STM32F2XX_RTC
    char new_date_time[256];
    //strftime(new_date_time, sizeof(new_date_time), "%c", target_tm);

    //char s[1024];
    /* fool gcc to prevent a Y2K warning */
    char time_format[] = "_c";
    time_format[0] = '%';
    // localtime (&t)
    strftime (new_date_time, sizeof (new_date_time), time_format, target_tm);

    //DPRINTF("%s: setting new date & time to: %s\n", __func__, new_date_time);
#endif
    return target_time_ticks;
}


// Return the current date and time as stored in the RTC TR and DR registers in two forms:
// By filling in the passed in tm struct and by returning the UTC time in seconds.
static time_t
l552_rtc_get_current_target_time(STM32L552RtcState *s, struct tm *target_tm)
{
    memset(target_tm, 0, sizeof(*target_tm));

    // Fill in the target_tm from the contents of the time register and date registers
    uint32_t time_reg = s->regs[R_RTC_TR];

    target_tm->tm_hour = from_bcd((time_reg & 0x003F0000) >> 16);
    bool pm = (time_reg & 0x00800000) != 0;
    if (pm && (s->regs[R_RTC_CR] & R_RTC_CR_FMT_MASK)) {
        target_tm->tm_hour += 12;
    }
    target_tm->tm_min = from_bcd((time_reg & 0x00007F00) >> 8);
    target_tm->tm_sec = from_bcd(time_reg & 0x0000007F);

    uint32_t date_reg = s->regs[R_RTC_DR];
    target_tm->tm_mday = from_bcd(date_reg & 0x3f);
    target_tm->tm_mon = from_bcd((date_reg & 0x00001F00) >> 8) - 1;
    target_tm->tm_year = from_bcd((date_reg & 0x00FF0000) >> 16) + 100;

    // Have mktime fill in the remaining fields and return the UTC seconds as well
    return mktimegm(target_tm);
}



// Compute the host to target offset based on the passed in target ticks and the current
//  host time.
static int64_t
l552_rtc_compute_host_to_target_offset(STM32L552RtcState *s, int64_t period_ns, time_t target_ticks)
{
    // Convert target ticks to real clock microseconds
    int64_t target_time_us = target_ticks * period_ns / 1000;

    // Get the host time in microseconds
    struct timeval tv;
    gettimeofday(&tv, NULL);
    int64_t host_time_us = tv.tv_sec * 1000000LL + (tv.tv_usec);

    // Get the host to target offset in micro seconds
    return target_time_us - host_time_us;
}

#define RTC_ISR_INITF_Pos             (6U)                                     
#define RTC_ISR_INITF_Msk             (0x1UL << RTC_ISR_INITF_Pos)              /*!< 0x00000040 */
#define RTC_ISR_INITF                 RTC_ISR_INITF_Msk                        

#define RTC_ISR_WUTF_Pos             (2U)                                     
#define RTC_ISR_WUTF_Msk             (0x1UL << RTC_ISR_WUTF_Pos)              /*!< 0x00000004 */
#define RTC_ISR_WUTF                 RTC_ISR_WUTF_Msk


static uint64_t
l552_rtc_read(void *arg, hwaddr addr, unsigned int size)
{
    STM32L552RtcState *s = arg;
    uint32_t r;
    int offset = addr & 0x3;

    addr >>= 2;
    if (addr >= R_RTC_MAX) {
        qemu_log_mask(LOG_GUEST_ERROR, "invalid read l552 rtc register 0x%x\n",
          (unsigned int)addr << 2);
        DPRINTF("  %s: result: 0\n", __func__);
        return 0;
    }

    // If reading the time or date register, make sure they are brought up to date first
    if (addr == R_RTC_TR || addr == R_RTC_DR) {
        l552_update_current_date_and_time(s);
    }

