Ebiroll/qemu-stm32/hw/arm/stm32/stm32l552_rtc.c
    uint32_t value = s->regs[addr];
    if (addr == R_RTC_ISR) {
        value |= R_RTC_ISR_RSF;
        // Hack for TSMV2. The RTC Wakeup timer write flag 

        /* Make sure RTC WUTWF flag is reset only when wakeup timer enabled */
        if ((s->regs[R_RTC_CR] & (0x1UL <<10U)) == 0) {
            // WUTWF should be set if the wakeup timer is enabled unless s->regs[R_RTC_ISR] & RTC_ISR_INITF

            
            if (s->regs[R_RTC_ISR] & RTC_ISR_INITF) {
                //value &= ~RTC_ISR_WUTF_Msk;
                value |= RTC_ISR_WUTF_Msk;
            }
        }
    }

    // HACK for Pebble. Clear the "entered standby" bit. If this bit is set, the Pebble
    // will only continue booting if one of the buttons is held down. Because the button GPIOs
    // are setup AFTER QEMU gets the key press event, it is difficult to set the GPIOs according
    // to the buttons held down before the reset. 
    if (addr == R_RTC_BKPxR) {
        value &= ~0x10000;
    }

    // If reading the sub-second register, determine what it should be from the current
    //  host time
    if (addr == R_RTC_SSR) {
        // How many ns are in in a full cycle of the subsecond counter?
        uint32_t prer = s->regs[R_RTC_PRER];;
        uint32_t prer_s = (prer >> R_RTC_PRER_PREDIV_S_SHIFT) & R_RTC_PRER_PREDIV_S_MASK;

        uint64_t full_cycle_us = l552_clock_period_ns(s) / 1000;

        // What fraction of a full cycle are we in?
        struct timeval tv;
        gettimeofday(&tv, NULL);
        int64_t host_time_us = tv.tv_sec * 1000000LL + (tv.tv_usec);
        host_time_us += s->host_to_target_offset_us;

        int64_t host_mod = host_time_us % full_cycle_us;
        double fract = (double)host_mod / full_cycle_us;

        // Compute the prescaler value
        value = prer_s - (fract * prer_s);
        DPRINTF("%s: SSR value = %d\n", __func__, value);
    }

    r = (value >> offset * 8) & ((1ull << (8 * size)) - 1);

#ifdef DEBUG_STM32F2XX_RTC
    // Debug printing
    if (addr == R_RTC_TR || addr == R_RTC_DR) {
        struct tm target_tm;
        l552_rtc_get_current_target_time(s, &target_tm);

        //char date_time_str[256];
        //strftime(date_time_str, sizeof(date_time_str), "%X", &target_tm);
        //DPRINTF("%s: current date/time: %s\n", __func__, date_time_str);
    } else {
        //DPRINTF("%s: addr: " PRIu64 ", size: %" PRIu64 ", value: " PRIu64 "\n", __func__, addr << 2, size, r);
        DPRINTF("%s: addr: %" PRIu64 ", data: %" PRIu64 ", size: %lu\n", __func__, addr,(long unsigned int) r,(long unsigned int) size);
    }
#endif
    if (addr==3) {
        static int times_c=0;
        if (times_c++>10) {
            r|=RTC_ISR_INITF;
        } 
        // RTC_ISR_INITF
        // r=0;
    }

    return r;
}

static void
l552_rtc_write(void *arg, hwaddr addr, uint64_t data, unsigned int size)
{
    STM32L552RtcState *s = arg;
    int offset = addr & 0x3;
    bool    compute_new_target_offset = false;
    bool    update_wut = false;

    //DPRINTF("%s: addr: 0x%llx, data: 0x%llx, size: %d\n", __func__, addr, data, size);
    // Same but use PRIu64
    DPRINTF("%s: addr: %" PRIu64 ", data: %" PRIu64 ", size: %x\n", __func__, addr, data, size);

    addr >>= 2;
    if (addr >= R_RTC_MAX) {
        qemu_log_mask(LOG_GUEST_ERROR, "invalid write l552 rtc register 0x%x\n",
          (unsigned int)addr << 2);
        return;
    }

    /* Special case for write protect state machine. */
    if (addr == R_RTC_WPR) {
        if (offset > 0) {
            return;
        }
        data &= 0xff;
        if ((s->wp_count == 0 && data == 0xca) ||
          (s->wp_count == 1 && data == 0x53)) {
            s->wp_count++;
        } else {
            s->wp_count = 0;
        }
        s->regs[addr] = data;
        return;
    }

    switch(size) {
    case 1:
        data = (s->regs[addr] & ~(0xff << (offset * 8))) | data << (offset * 8);
        break;
    case 2:
        data = (s->regs[addr] & ~(0xffff << (offset * 8))) | data << (offset * 8);
        break;
    case 4:
        break;
    default:
        abort();
    }
    if (addr >= R_RTC_BKPxR && addr <= R_RTC_BKPxR_INC_EXTRA_LAST) {
        s->regs[addr] = data;
        return;
    }
    /* Write protect */
    if (s->wp_count < 2 && addr != R_RTC_TAFCR && addr != R_RTC_ISR
            && addr != R_RTC_WPR) {
        qemu_log_mask(LOG_GUEST_ERROR, "l552 rtc write reg 0x%x+%u without wp disable\n",
                      (unsigned int)addr << 2, offset);
        return;
    }
    switch(addr) {
    case R_RTC_TR:
    case R_RTC_DR:
        compute_new_target_offset = true;
        break;
    case R_RTC_CR:
        if ((data & R_RTC_CR_WUTE) != (s->regs[R_RTC_CR] & R_RTC_CR_WUTE)) {
            update_wut = true;
        }
        {
            int64_t delay_ns;

            if (data & 0x03) {
                // Assuming ck_apre is derived from RTCCLK and has some frequency
                // Let's say it's some constant CK_APRE_PERIOD_IN_NS for this example
                delay_ns = 62500 + 62500; // +1 RTCCLK cycle
            } else {
                delay_ns = 62500; // Just 1 RTCCLK cycle
            }
            timer_mod_ns(s->wut_delay_timer, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + delay_ns);
        }
        break;
    case R_RTC_ISR:
        if ((data & 1<<8) == 0 && (s->regs[R_RTC_ISR] & 1<<8) != 0) {
            DPRINTF("l552 rtc isr lowered\n");
            qemu_irq_lower(s->irq[0]);
        }
        if ((data & 1<<10) == 0 && (s->regs[R_RTC_ISR] & 1<<10) != 0) {
            DPRINTF("l552 rtc WUT isr lowered\n");
            qemu_irq_lower(s->wut_irq);
        }
        s->regs[R_RTC_ISR] = data;
        break;
    case R_RTC_PRER:
        /*
         * XXX currently updates upon next clock tick.  To do this properly we
         * would need to account for the time already elapsed, and then update
         * the timer for the remaining period.
         */
        break;
    case R_RTC_WUTR:
        update_wut = true;
        break;
    case R_RTC_ALRMAR:
    case R_RTC_ALRMBR:
        break;
        /*
    case R_RTC_TAFCR:
        if (data) {
            qemu_log_mask(LOG_UNIMP,
              "l552 rtc unimplemented write TAFCR+%u size %u val %u\n",
              offset, size, (unsigned int)data);
        }
    */
        break;
    default:
        qemu_log_mask(LOG_UNIMP, "l552 rtc unimplemented write 0x%x+%u size %u val 0x%x\n",
          (unsigned int)addr << 2, offset, size, (unsigned int)data);
    }
    s->regs[addr] = data;


    // Do we need to recompute the host to target offset?
    if (compute_new_target_offset) {
        struct tm target_tm;
        // Recompute ticks based on the modified contents of the TR and DR registers
        s->ticks = l552_rtc_get_current_target_time(s, &target_tm);
        // Update the host to target offset as well
        s->host_to_target_offset_us = l552_rtc_compute_host_to_target_offset(s,
        								l552_clock_period_ns(s), s->ticks);
    }

    // Do we need to update the timer for the wake-up-timer?
    if (update_wut) {
        if (s->regs[R_RTC_CR] & R_RTC_CR_WUTE) {
            int64_t elapsed = l552_wut_period_ns(s, s->regs[R_RTC_WUTR]);
            DPRINTF("%s: scheduling WUT to fire in %f ms\n", __func__, (float)elapsed/1000000.0);
            timer_mod(s->wu_timer, qemu_clock_get_ns(QEMU_CLOCK_REALTIME) + elapsed);
        } else {
            DPRINTF("%s: Cancelling WUT\n", __func__);
            qemu_set_irq(s->wut_irq, 0);
            timer_del(s->wu_timer);
        }
    }
}


static bool
l552_alarm_match(STM32L552RtcState *s, uint32_t alarm_reg)
{
    uint32_t tr = s->regs[R_RTC_TR];

    if ((alarm_reg & (1<<7)) == 0 && (tr & 0x7f) != (alarm_reg & 0x7f)) {
        /* Seconds match requested, but do not match. */
        return false;
    }
    if ((alarm_reg & (1<<15)) == 0 && (tr & 0x7f00) != (alarm_reg & 0x7f00)) {
        /* Minutes match requested, but do not match. */
        return false;
    }
    if ((alarm_reg & (1<<23)) == 0 && (tr & 0x7f0000) != (alarm_reg & 0x7f0000)) {
        /* Hours match requested, but do not match. */
        return false;
    }
    if ((alarm_reg & (1<<31)) == 0) { /* Day match. */
        uint32_t dr = s->regs[R_RTC_DR];
        if (alarm_reg & (1<<30)) { /* Day is week day. */
            if (((alarm_reg>>24) & 0xf) != ((dr>>13) & 0xf)) {
                return false;
            }
        } else { /* Day is day of month. */
            if (((alarm_reg>>24) & 0x3f) != (dr & 0x3f)) {
                return false;
            }
        }
    }
    return true;
}

static void
l552_alarm_check(STM32L552RtcState *s, int unit)
{
    uint32_t cr = s->regs[R_RTC_CR];
    uint32_t isr = s->regs[R_RTC_ISR];

    if ((cr & 1<<(R_RTC_CR_ALRAE_BIT + unit)) == 0) {
        return; /* Not enabled. */
    }

