Ebiroll/qemu-stm32/hw/arm/stm32/stm32l552_rtc.c
    if ((isr & 1<<(R_RTC_CR_ALRAE_BIT + unit)) == 0) {
        if (l552_alarm_match(s, s->regs[R_RTC_ALRMAR + unit])) {
            isr |= 1<<(8 + unit);
            s->regs[R_RTC_ISR] = isr;
            DPRINTF("l552 rtc alarm activated 0x%x 0x%x\n", isr, cr);
        }
    }
	qemu_set_irq(s->irq[unit], cr & 1<<(12 + unit) && isr & 1<<(8 + unit));
}

// This method updates the current time and date registers to match the current
// host time. While it advances the target time, it checks for alarms that need to fire.
static void
l552_update_current_date_and_time(void *arg)
{
    STM32L552RtcState *s = arg;
    uint64_t period_ns = l552_clock_period_ns(s);
    
    struct tm new_target_tm;
    time_t new_target_ticks = l552_rtc_compute_target_time_from_host_time(s,
                                  period_ns, &new_target_tm);


    // Normally, we would advance the target ticks until we catch up to the host ticks and
    // check for an alarm at each tick. But, if the clocks got too far off (host or target
    // changed time), just jam in the new target time without checking alarms
    int delta = new_target_ticks - s->ticks;
    //DPRINTF("%s: advancing target by %d ticks\n", __func__, delta);
    if (delta < 0 || delta > 1000) {
        printf("DEBUG_STM32F2XX_RTC %s: detected %d mismatch between host and target ticks, "
              "jamming new host time into RTC without checking for alarms\n", __func__, delta);
        s->ticks = new_target_ticks;
        l552_rtc_set_time_and_date_registers(s, &new_target_tm);
    } else {
        while (s->ticks != new_target_ticks) {
            s->ticks += 1;
            gmtime_r(&s->ticks, &new_target_tm);
            l552_rtc_set_time_and_date_registers(s, &new_target_tm);

            l552_alarm_check(s, 0);
            l552_alarm_check(s, 1);
        }
    }

    // Reschedule tick timer to run one tick from now to check for alarms again
    timer_mod(s->timer, qemu_clock_get_ns(QEMU_CLOCK_HOST) + period_ns);
}


// This timer runs on every tick (usually second)
static void
l552_timer(void *arg)
{
    STM32L552RtcState *s = arg;
    l552_update_current_date_and_time(s);
}


// This timer fires when the wake up time has expired
static void
l552_wu_timer(void *arg)
{
    STM32L552RtcState *s = arg;

    //DPRINTF("%s: fired\n", __func__);

    // Fire the interrupt?
    uint32_t cr = s->regs[R_RTC_CR];
    uint32_t isr = s->regs[R_RTC_ISR];

    // Make sure WUT is enabled
    if ( (cr & R_RTC_CR_WUTE) == 0 ) {
        return; /* Not enabled */
    }

    // If interrupt not already asserted, assert it
    if ( (isr & R_RTC_ISR_WUT) == 0 ) {
        isr |= R_RTC_ISR_WUT;
        s->regs[R_RTC_ISR] = isr;
        DPRINTF("l552 wakeup timer ISR activated 0x%x 0x%x\n", isr, cr);
    }

    qemu_set_irq(s->wut_irq, (cr & R_RTC_CR_WUTIE) && (isr & R_RTC_ISR_WUT));

    // Reschedule again
    int64_t elapsed = l552_wut_period_ns(s, s->regs[R_RTC_WUTR]);
    timer_mod(s->wu_timer, qemu_clock_get_ns(QEMU_CLOCK_REALTIME) + elapsed);
}


// External interface to set the value of an "extra" backup register. This can be used to
// communicate emulator specific settings to the target
void l552_rtc_set_extra_bkup_reg(void *opaque, uint32_t idx, uint32_t value)
{
    STM32L552RtcState *s = (STM32L552RtcState *)opaque;

     // Copy in the extra backup registers that were specified via properties
    assert(idx < STM32F2XX_RTC_NUM_EXTRA_BKUP_REG);
    s->regs[R_RTC_BKPxR_LAST + 1 + idx] = value;
}



static const MemoryRegionOps l552_rtc_ops = {
    .read = l552_rtc_read,
    .write = l552_rtc_write,
    .endianness = DEVICE_NATIVE_ENDIAN,
    .impl = {
        .min_access_size = 1,
        .max_access_size = 4,
    }
};

static void l552_rtc_reset(DeviceState *dev)
{
    struct STM32L552RtcState *s = OBJECT_CHECK(struct STM32L552RtcState, dev, "stm32l552-rtc");
    // STM32L552RtcState *s = FROM_SYSBUS(STM32L552RtcState, SYS_BUS_DEVICE(dev));
    s->regs[R_RTC_CR] = 0;
}


static void wut_delay_callback(void *opaque)
{
    STM32L552RtcState *s = (STM32L552RtcState *)opaque;

    if ((s->regs[R_RTC_CR] & R_RTC_CR_WUTE) == 0) {
        /* Set WUTWF */
        s->regs[R_RTC_ISR]  |= RTC_ISR_WUTF_Msk;
    } else {
        /* Clear WUTWF */

        s->regs[R_RTC_ISR]  &= ~RTC_ISR_WUTF_Msk;
    }

    /* Further handling if needed */
}



static void
l552_rtc_realize(DeviceState *dev, Error **errp)
{
    // STM32L552RtcState *s = FROM_SYSBUS(STM32L552RtcState, dev);
    struct STM32L552RtcState *s = OBJECT_CHECK(struct STM32L552RtcState, dev, "stm32l552-rtc");
    SysBusDevice *busdev = SYS_BUS_DEVICE(dev);


    memory_region_init_io(&s->iomem, OBJECT(s), &l552_rtc_ops, s, "rtc", 0x03ff);
    sysbus_init_mmio(busdev, &s->iomem);

    sysbus_init_irq(busdev, &s->irq[0]);
    sysbus_init_irq(busdev, &s->irq[1]);
    sysbus_init_irq(busdev, &s->wut_irq);

    s->regs[R_RTC_ISR] = R_RTC_ISR_RESET;
    s->regs[R_RTC_PRER] = R_RTC_PRER_RESET;
    s->regs[R_RTC_WUTR] = R_RTC_WUTR_RESET;

    uint32_t period_ns = l552_clock_period_ns(s);
    DPRINTF("%s: period: %d ns\n", __func__, period_ns);

    // Init the time and date registers from the time on the host as the default
    s->host_to_target_offset_us = 0;
    struct tm now;
    qemu_get_timedate(&now, 0);

    // Set time and date registers from the now struct
    l552_rtc_set_time_and_date_registers(s, &now);

    // Compute current ticks and host to target offset
    s->ticks = mktimegm(&now);
    s->host_to_target_offset_us = l552_rtc_compute_host_to_target_offset(s,
                                        l552_clock_period_ns(s), s->ticks);

    s->timer = timer_new_ns(QEMU_CLOCK_HOST, l552_timer, s);
    timer_mod(s->timer, qemu_clock_get_ns(QEMU_CLOCK_HOST) + period_ns);

    s->wu_timer = timer_new_ns(QEMU_CLOCK_REALTIME, l552_wu_timer, s);

    s->wut_delay_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL, wut_delay_callback, s);
}

static Property l552_rtc_properties[] = {
    DEFINE_PROP_END_OF_LIST(),
};

static void
l552_rtc_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    //SysBusDeviceClass *sc = SYS_BUS_DEVICE_CLASS(klass);
    dc->realize = l552_rtc_realize;
    //TODO: fix this: dc->no_user = 1;
    dc->props_ = l552_rtc_properties;
    dc->reset = l552_rtc_reset;
}

static const TypeInfo
l552_rtc_info = {
    .name          = "stm32l552-rtc",
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(l552_rtc),
    .class_init    = l552_rtc_class_init,
};

static void
l552_rtc_register_types(void)
{
    type_register_static(&l552_rtc_info);
}

type_init(l552_rtc_register_types)
